<a href="https://colab.research.google.com/github/leovegamedina/projects-ml/blob/main/Titanic_Kmeans_MLCourse.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive

drive.mount('/content/gdrive')
root_path = 'gdrive/My Drive/Projects/Unsupervised MLA/K-Means'

Mounted at /content/gdrive

In [2]:
import pandas as pd
import numpy as np

titanic_org = pd.read_excel(root_path + '/' + 'Titanic.xlsx')

In [3]:
titanic_org.head()

                                              Name  ... Survived
0                    Allen, Miss. Elisabeth Walton  ...      Yes
1                   Allison, Master. Hudson Trevor  ...      Yes
2                     Allison, Miss. Helen Loraine  ...       No
3             Allison, Mr. Hudson Joshua Creighton  ...       No
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...       No

[5 rows x 10 columns]